{
  "id": 2,
  "created_on": "Feb 6, 2018",
  "name": "Building a Chat UI with basic HTML, CSS, and Javascript: Part 2",
  "description": "A continuation from part 1, focusing on simple user interaction and updating the browser screen with easy to understand commands.",
  "next": 3,
  "prev": 1,
  "html": "<p class='subtitle'>This tutorial focuses on adding simple javascript functions to a User Interface.  The goal is to provide a methodology for beginner Javascript writers to get a feel for how to create functional interactions with their content, using tools available to every modern computer user.</p><p>In the last tutorial we created a template, styled it and mocked some data and appended it to our template. With that taken care of, let's added some functions to get our users interacting with our User Interface in a simple yet functional way. We are going to focus on a couple things to get our UI's functionality working:</p><ul class='articleList'><li>A function that selects a conversation when a name in the conversations list is clicked:<h4 class='codeTitle'>chat.js</h4><code class='codeBlock'>function selectConversation()</code></li><li>A function for adding messages to our displayed message list:<h4 class='codeTitle'>chat.js</h4><code class='codeBlock'>function displayMessage()</code></li><li>A function for sending message to our message list:<h4 class='codeTitle'>chat.js</h4><code class='codeBlock'>function displayMessages()</code></li><li>Finally we will add some styling to our elements to get things looking a little more like our prototype: <code>style.css</code></li></ul><p>We are going to focus mostly on javascript now in order to program our Chat Applications so let's get started!</p><div class='divider'></div><h3 class='contentHeading'>We'll begin by opening up our javascript file and whiteboarding our solution</h3><p>Before we begin writing any code we should go through what we are trying to achieve with our programming. In this case we are trying to add some functions that will run when the user does something in our interface.</p><p>Let's start with our selectConversation function and define a goal for our javascript, I often like to use comments in my code to keep me on track:</p><h4 class='codeTitle'>chat.js</h4><code class='codeBlock prettyprint linenums:60'>// 1)This function is run when a user<br> // &nbsp clicks on a name in the conversationList,<br> // 2)It defines who we are sending messages <br> // &nbsp to and what messages are displayed in the messageList<br>function selectConversation() { }<br></code><p>Now let's add some pseudocode to our block to break down how we are going to achieve our goal, we'll start with very broad steps and get more granular as we :</p><code class='codeBlock prettyprint linenums:60'>// 1)This function is run when a user<br> // &nbsp clicks on a name in the conversationList,<br> // 2)It defines who we are sending messages <br> // &nbsp to and what messages are displayed in the messageList<br>function selectConversation() {<br>&nbsp // identify the conversation that is being clicked on.<br>&nbsp &nbsp // find messages associated with that identity.<br>&nbsp &nbsp &nbsp // return those messages.<br>}</code><h2>THIS ARTICLE IS UNDER CONSTRUCTION :)</h2>"
}